<a href="https://colab.research.google.com/github/MdShahadatHossainbd/ML/blob/master/14_naive_bayes_1_titanic_survival_prediction.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("titanic.csv")
df.head()

   PassengerId  ... Survived
0            1  ...        0
1            2  ...        1
2            3  ...        1
3            4  ...        1
4            5  ...        0

[5 rows x 12 columns]

In [3]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [5]:
inputs = df.drop('Survived',axis='columns')
target = df.Survived

In [6]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [7]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [8]:
inputs.drop(['Sex','male'],axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1

In [9]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [10]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [11]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [12]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.3)

In [13]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [14]:
model.fit(X_train,y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [15]:
model.score(X_test,y_test)

0.7649253731343284

In [16]:
X_test[0:10]

     Pclass        Age     Fare  female
125       3  12.000000  11.2417       0
372       3  19.000000   8.0500       0
510       3  29.000000   7.7500       0
374       3   3.000000  21.0750       1
214       3  29.699118   7.7500       0
778       3  29.699118   7.7375       0
458       2  50.000000  10.5000       1
687       3  19.000000  10.1708       0
852       3   9.000000  15.2458       1
451       3  29.699118  19.9667       0

In [17]:
y_test[0:10]

125    1
372    0
510    1
374    0
214    0
778    0
458    1
687    0
852    0
451    0
Name: Survived, dtype: int64

In [18]:
model.predict(X_test[0:10])

array([0, 0, 0, 1, 0, 0, 1, 0, 1, 0])

In [19]:
model.predict_proba(X_test[:10])

array([[0.96001004, 0.03998996],
       [0.96626301, 0.03373699],
       [0.97204515, 0.02795485],
       [0.35758101, 0.64241899],
       [0.97231772, 0.02768228],
       [0.97231497, 0.02768503],
       [0.34336292, 0.65663708],
       [0.96671485, 0.03328515],
       [0.4159631 , 0.5840369 ],
       [0.97265466, 0.02734534]])

In [20]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),X_train, y_train, cv=5)

array([0.752     , 0.8       , 0.8       , 0.76612903, 0.76612903])